tests/validation/galinat_quarter/0/T.water
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 302.15;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 302.15;
    }
    outlet
    {
        type            inletOutlet;
        phi             phi.water;
        inletValue      uniform 302.15;
        value           uniform 302.15;
    }
    walls
    {
        type            zeroGradient;
    }
    symmetry1
    {
        type            symmetryPlane;
    }
    symmetry2
    {
        type            symmetryPlane;
    }
}


// ************************************************************************* //
