tests/validation/galinat_quarter/constant/phaseProperties
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.3;
 format ascii;
 class dictionary;
 location "constant";
 object phaseProperties;
}

phases
  (
    oil
    water
  );

oil
{
  diameterModel constant;
  constantCoeffs
  {
    d 0.0026;
  }
}

water
{
  diameterModel constant;
  constantCoeffs
  {
    d 0.001;
  }
}

blending
{
  default
  {
    type none;
    continuousPhase water;
  }
}

sigma
  (

    (
      oil
      and
      water
    )
    0.0
  );

aspectRatio
  (

    (
      oil
      in
      water
    )

    {
      type constant;
      E0 1.0;

    }
  );

drag
  (

    (
      oil
      in
      water
    )

    {
      type SchillerNaumann;
      residualAlpha 1e-06;
      residualRe 0.001;
      swarmCorrection
      {
        type none;
      }

    }
  );

virtualMass
  (

    (
      oil
      in
      water
    )

    {
      type constantCoefficient;
      Cvm 0.5;

    }
  );

heatTransfer
  (

    (
      oil
      in
      water
    )

    {
      type RanzMarshall;
      residualAlpha 0.0001;

    }
  );

lift
  (
  );

wallLubrication
  (
  );

turbulentDispersion
  (
  ); 	// Minimum allowable pressure

pMin 10000; 	// ************************************************************************* //

