tests/validation/galinat_quarter/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  2.0.0                                 |
|   \  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \/     M anipulation  |                                                 |
*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
convertToMeters 0.01;

//
// -------------x       x-----------------------
//              |       |
//              x-------x
//
//               orifice
//
//              x-------x
//              |       |
// -------------x       x-----------------------
//
//     ncz1        ncz2            ncz3
//
// ncz1 - number of cells in z-direction before the orifice
// ncz2 - number of cells in z-direction in the orifice
// ncz3 - number of cells in z-direction after the orifice
// na   - number of cells in the angular direction representing one-quarter of the circle
// nr1  - number of cells in the radial direction of the inner circle (orifice)
// nr2  - number of cells in the radial direction of the outter circle (pipe)

ncz1 80;
ncz3 120;
ncz2 6;
na   6;
nr1  5;
nr2  5;

vertices
(
         (-0.265165 -0.265165 -40 ) //0
         (0.265165 -0.265165 -40 ) //1
         (0.265165 0.265165 -40 ) //2
         (-0.265165 0.265165 -40 ) //3
         (-0.265165 -0.265165 0 ) //4
         (0.265165 -0.265165 0 ) //5
         (0.265165 0.265165 0 ) //6
         (-0.265165 0.265165 0 ) //7
         (0.53033 0.53033 -40 ) //8
         (-0.53033 0.53033 -40 ) //9
         (0.53033 0.53033 0 ) //10
         (-0.53033 0.53033 0 ) //11
         (-0.53033 -0.53033 -40 ) //12
         (-0.53033 -0.53033 0 ) //13
         (0.53033 -0.53033 -40 ) //14
         (0.53033 -0.53033 0 ) //15
         (1.06066 1.06066 -40 ) //16
         (-1.06066 1.06066 -40 ) //17
         (1.06066 1.06066 0 ) //18
         (-1.06066 1.06066 0 ) //19
        (-1.06066 -1.06066 -40 ) //20
        (-1.06066 -1.06066 0 ) //21
        (1.06066 -1.06066 -40 ) //22
        (1.06066 -1.06066 0 ) //23
        (-0.265165 -0.265165 0.5 ) //24
        (0.265165 -0.265165 0.5 ) //25
        (0.265165 0.265165 0.5 ) //26
        (-0.265165 0.265165 0.5 ) //27
        (0.53033 0.53033 0.5 ) //28
        (-0.53033 0.53033 0.5 ) //29
        (-0.53033 -0.53033 0.5 ) //30
        (0.53033 -0.53033 0.5 ) //31
        (-0.265165 -0.265165 60 ) //32
        (0.265165 -0.265165 60 ) //33
        (0.265165 0.265165 60 ) //34
        (-0.265165 0.265165 60 ) //35
        (0.53033 0.53033 60 ) //36
        (-0.53033 0.53033 60 ) //37
        (-0.53033 -0.53033 60 ) //38
        (0.53033 -0.53033 60 ) //39
        (1.06066 1.06066 0.5 ) //40
        (-1.06066 1.06066 0.5 ) //41
        (1.06066 1.06066 60 ) //42
        (-1.06066 1.06066 60 ) //43
        (-1.06066 -1.06066 0.5 ) //44
        (-1.06066 -1.06066 60 ) //45
        (1.06066 -1.06066 0.5 ) //46
        (1.06066 -1.06066 60 ) //47
);

edges
(
         arc 0 1 (0 -0.318198 -40)
         arc 1 2 (0.318198 -1.19887e-08 -40)
         arc 2 3 (0 0.318198 -40)
         arc 3 0 (-0.318198 -1.19887e-08 -40)
         arc 4 5 (0 -0.318198 0)
         arc 5 6 (0.318198 -1.19887e-08 0)
         arc 6 7 (0 0.318198 0)
         arc 7 4 (-0.318198 -1.19887e-08 0)
         arc 8 9 (-1.04318e-08 0.75 -40)
         arc 10 11 (-1.04318e-08 0.75 0)
         arc 9 12 (-0.75 2.38399e-08 -40)
         arc 11 13 (-0.75 2.38399e-08 0)
         arc 12 14 (-8.04633e-08 -0.75 -40)
         arc 13 15 (-8.04633e-08 -0.75 0)
         arc 14 8 (0.75 -4.76798e-08 -40)
         arc 15 10 (0.75 -4.76798e-08 0)
         arc 16 17 (-2.08636e-08 1.5 -40)
         arc 18 19 (-2.08636e-08 1.5 0)
         arc 17 20 (-1.5 4.76798e-08 -40)
         arc 19 21 (-1.5 4.76798e-08 0)
        arc 20 22 (-1.60927e-07 -1.5 -40)
        arc 21 23 (-1.60927e-07 -1.5 0)
        arc 22 16 (1.5 -9.53595e-08 -40)
        arc 23 18 (1.5 -9.53595e-08 0)
        arc 24 25 (0 -0.318198 0.5)
        arc 25 26 (0.318198 -1.19887e-08 0.5)
        arc 26 27 (0 0.318198 0.5)
        arc 27 24 (-0.318198 -1.19887e-08 0.5)
        arc 28 29 (-1.04318e-08 0.75 0.5)
        arc 29 30 (-0.75 2.38399e-08 0.5)
        arc 30 31 (-8.04633e-08 -0.75 0.5)
        arc 31 28 (0.75 -4.76798e-08 0.5)
        arc 32 33 (0 -0.318198 60)
        arc 33 34 (0.318198 -1.19887e-08 60)
        arc 34 35 (0 0.318198 60)
        arc 35 32 (-0.318198 -1.19887e-08 60)
        arc 36 37 (-1.04318e-08 0.75 60)
        arc 37 38 (-0.75 2.38399e-08 60)
        arc 38 39 (-8.04633e-08 -0.75 60)
        arc 39 36 (0.75 -4.76798e-08 60)
        arc 40 41 (-2.08636e-08 1.5 0.5)
        arc 42 43 (-2.08636e-08 1.5 60)
        arc 41 44 (-1.5 4.76798e-08 0.5)
        arc 43 45 (-1.5 4.76798e-08 60)
        arc 44 46 (-1.60927e-07 -1.5 0.5)
        arc 45 47 (-1.60927e-07 -1.5 60)
        arc 46 40 (1.5 -9.53595e-08 0.5)
        arc 47 42 (1.5 -9.53595e-08 60)
);

blocks
(
        // inner quadrant
        hex (4 5 6 7 24 25 26 27 ) ($na $na $ncz2 ) simpleGrading (1 1 1 )
        hex (0 1 2 3 4 5 6 7 ) ($na $na $ncz1 ) simpleGrading (1 1 0.1 )
        hex (24 25 26 27 32 33 34 35 ) ($na $na $ncz3 ) simpleGrading (1 1 10 )

        // orifice
        hex (2 8 9 3 6 10 11 7 ) ($nr1 $na $ncz1 ) simpleGrading (1 1 0.1 )
        hex (3 9 12 0 7 11 13 4 ) ($nr1 $na $ncz1 ) simpleGrading (1 1 0.1 )
        hex (0 12 14 1 4 13 15 5 ) ($nr1 $na $ncz1 ) simpleGrading (1 1 0.1 )
        hex (1 14 8 2 5 15 10 6 ) ($nr1 $na $ncz1 ) simpleGrading (1 1 0.1 )
        hex (8 16 17 9 10 18 19 11 ) ($nr2 $na $ncz1 ) simpleGrading (1 1 0.1 )
        hex (9 17 20 12 11 19 21 13 ) ($nr2 $na $ncz1 ) simpleGrading (1 1 0.1 )
        hex (12 20 22 14 13 21 23 15 ) ($nr2 $na $ncz1 ) simpleGrading (1 1 0.1 )
        hex (14 22 16 8 15 23 18 10 ) ($nr2 $na $ncz1 ) simpleGrading (1 1 0.1 )
        hex (6 10 11 7 26 28 29 27 ) ($nr1 $na $ncz2 ) simpleGrading (1 1 1 )
        hex (7 11 13 4 27 29 30 24 ) ($nr1 $na $ncz2 ) simpleGrading (1 1 1 )
        hex (4 13 15 5 24 30 31 25 ) ($nr1 $na $ncz2 ) simpleGrading (1 1 1 )
        hex (5 15 10 6 25 31 28 26 ) ($nr1 $na $ncz2 ) simpleGrading (1 1 1 )
        hex (26 28 29 27 34 36 37 35 ) ($nr1 $na $ncz3 ) simpleGrading (1 1 10 )
        hex (27 29 30 24 35 37 38 32 ) ($nr1 $na $ncz3 ) simpleGrading (1 1 10 )
        hex (24 30 31 25 32 38 39 33 ) ($nr1 $na $ncz3 ) simpleGrading (1 1 10 )
        hex (25 31 28 26 33 39 36 34 ) ($nr1 $na $ncz3 ) simpleGrading (1 1 10 )
        hex (28 40 41 29 36 42 43 37 ) ($nr2 $na $ncz3 ) simpleGrading (1 1 10 )
        hex (29 41 44 30 37 43 45 38 ) ($nr2 $na $ncz3 ) simpleGrading (1 1 10 )
        hex (30 44 46 31 38 45 47 39 ) ($nr2 $na $ncz3 ) simpleGrading (1 1 10 )
        hex (31 46 40 28 39 47 42 36 ) ($nr2 $na $ncz3 ) simpleGrading (1 1 10 )
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
		(0 1 2 3)
		(2 8 9 3)
		(3 9 12 0)
		(0 12 14 1)
		(1 14 8 2)
		(8 16 17 9)
		(9 17 20 12)
		(12 20 22 14)
		(14 22 16 8)
	);
	}

	outlet
	{
	type patch;
	faces
	(
		(32 33 34 35)
		(34 36 37 35)
		(35 37 38 32)
		(32 38 39 33)
		(33 39 36 34)
		(36 42 43 37)
		(37 43 45 38)
		(38 45 47 39)
		(39 47 42 36)
	);
	}

	walls
	{
	type wall;
	faces
	(
		(16 17 19 18)
		(17 20 21 19)
		(20 22 23 21)
		(22 16 18 23)
		(40 41 43 42)
		(41 44 45 43)
		(44 46 47 45)
		(46 40 42 47)
		(10 18 19 11)
		(11 19 21 13)
		(13 21 23 15)
		(15 23 18 10)
		(28 40 41 29)
		(29 41 44 30)
		(30 44 46 31)
		(31 46 40 28)
		(10 11 29 28)
		(11 13 30 29)
		(13 15 31 30)
		(15 10 28 31)
	);
	}

);

