tests/validation/galinat_quarter/system/controlDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 location "system";
 object controlDict;
}

application multiphaseEulerFoam;

startFrom latestTime;

startTime 0;

stopAt endTime;

endTime 2;

deltaT 0.0001; 	//3e-04;//5e-05;//0.00005;

writeControl timeStep; 	//timeStep;//runTime;//timeStep;//adjustableRunTime;

writeInterval 100;

purgeWrite 0;

writeFormat ascii;

writePrecision 6;

writeCompression uncompressed;

timeFormat general;

timePrecision 10;

runTimeModifiable yes;
adjustTimeStep no;
maxCo 0.25;

maxDeltaT 0.01;


