tests/validation/galinat_quarter/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    half;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            boxes ((-100 -100 -100) (100 0 100));
        };
    }
    {
        name    quarter;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            boxes ((-100 -100 -100) (0 0 100));
        };
    }
);

// ************************************************************************* //
